import os
from dotenv import load_dotenv

load_dotenv()

# --- CLOUDINARY НАЛАШТУВАННЯ ---
CLOUDINARY_CLOUD_NAME = os.getenv("CLOUDINARY_CLOUD_NAME")
CLOUDINARY_API_KEY = os.getenv("CLOUDINARY_API_KEY")
CLOUDINARY_API_SECRET = os.getenv("CLOUDINARY_API_SECRET")

# Налаштування директорій
STORAGE_DIR = "storage/images"
os.makedirs(STORAGE_DIR, exist_ok=True)

# Базові константи
SILPO_BASE_IMG_URL = "https://images.silpo.ua/v2/products/1000x1000/webp/"

# Заголовки для парсингу
SILPO_HEADERS = {
    'accept': 'application/json',
    'origin': 'https://silpo.ua',
    'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 Chrome/145.0.0.0 Safari/537.36',
}

FORA_HEADERS = {
    'accept': 'application/json, text/plain, */*',
    'content-type': 'application/json',
    'origin': 'https://fora.ua',
    'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 Chrome/145.0.0.0 Safari/537.36',
}

# config.py

# ... твої інші налаштування ...

# Конфігурація для магазинів екосистеми Zakaz.ua
ZAKAZ_STORES = {
    "novus": {
        "id": "48201031",
        "name": "Novus"
    },
    "auchan": {
        "id": "48246401",
        "name": "Auchan"
    },
    "megamarket": {
        "id": "48267602",
        "name": "Megamarket"
    },
    "ekomarket": {
        "id": "482800245",
        "name": "Ekomarket"
    },
    "torba": {
        "id": "482867220",
        "name": "Torba"
    },
    "ultramarket": {
        "id": "48277601",
        "name": "Ultramarket"
    },
    "metro": {
        "id": "48215611",
        "name": "Metro"
    }
}

VARUS_STORES = {
    "Борщаговка_с_Софиевская_Борщаговка_ул_Леси_Украинки_30": "139224",
    "Бровары_ул_Героев_Украины_16_ТД_Лиза": "130727",
    "Бровары_ул_Киевская_239": "92",
    "Бровары_ул_Черных_Запорожцев_72": "139257",
    "Вольногорск_ул_Центральная_26": "130744",
    "Вышгород_г_Вышгород_ул_Днепровская_1": "130696",
    "Днепр_бул_Европейский_1Д_ТЦ_Европа": "130671",
    "Днепр_г_Днепр_проспект_Слобожанский_86": "139227",
    "Днепр_г_Днепр_ул_Паникахи_15": "1",
    "Днепр_пр_Александра_Поля_104А_ТЦ_Славутич": "9",
    "Днепр_пр_Александра_Поля_11_ТЦ_Мириада": "130529",
    "Днепр_пр_Богдана_Хмельницкого_118Д_ТРЦ_Терра": "3",
    "Днепр_пр_Гагарина_8А_ТЦ_Нагорка": "46",
    "Днепр_пр_Героев_2": "57",
    "Днепр_пр_Д_Яворницкого_106": "130732",
    "Днепр_пр_Ивана_Мазепы_58": "33",
    "Днепр_пр_Мира_61А": "130522",
    "Днепр_ул_20_летия_Победы_43Д": "130533",
    "Днепр_ул_Березинская_23А": "139258",
    "Днепр_ул_Глинки_2_ТРЦ_Мост_Сити": "2",
    "Днепр_ул_Данила_Галицкого_29": "130570",
    "Днепр_ул_Донецкое_шоссе_110": "23",
    "Днепр_ул_Донецкое_шоссе_9А_ТЦ_СЕКТОР": "7",
    "Днепр_ул_Ивана_Акинфиева_9В": "130707",
    "Днепр_ул_Калиновая_9А_ТЦ_Мириада": "31",
    "Днепр_ул_Марии_Кюри_5": "63",
    "Днепр_ул_Рабочая_67": "130536",
    "Днепр_ул_Шолохова_7": "130716",
    "Днепр_ул_Юрия_Кондратюка_8": "139252",
    "Ж_лтые_Воды_м_Жовті_Води_вул_Казацькой_Слави_16": "139262",
    "Запорожье_г_Запорожье_ул_Бородинская_7": "130734",
    "Запорожье_ул_Независимой_Украины_57В": "130558",
    "Запорожье_ул_Северо_Кольцевая_10А": "45064",
    "Запорожье_ул_Товарищеская_39_ТЦ_Континент": "45066",
    "Запорожье_ул_Яценка_2": "45067",
    "Ирпень_вул_Ольги_Кобилянської_1В_23": "139255",
    "Каменское_бул_Строителей_27А_ТЦ_Терра": "139253",
    "Каменское_пр_Победы_14": "130728",
    "Каменское_пр_Тараса_Шевченко_7": "130497",
    "Киев_вул_Червоної_Калини_44а": "139256",
    "Киев_г_Киев_ул_Тютюника_39А": "139225",
    "Киев_пр_Академика_Палладина_16_39_ТЦ_ACADEM_CITY": "54",
    "Киев_пр_Николая_Бажана_38": "130563",
    "Киев_пр_Оболонский_47_42_ТЦ_Оазис": "130551",
    "Киев_пр_Победы_129": "130724",
    "Киев_ул_А_Малышко_3_ТЦ_Детский_мир": "139260",
    "Киев_ул_Васильковская_34": "38",
    "Киев_ул_Волынская_37": "67",
    "Киев_ул_Вышгородская_45а_5": "139261",
    "Киев_ул_Героев_полка_Азов_12": "130700",
    "Киев_ул_Демеевская_27": "98",
    "Киев_ул_Драгоманова_40г": "130578",
    "Киев_ул_Жилянская_59": "90",
    "Киев_ул_Константиновская_2А": "130723",
    "Киев_ул_Николая_Бажана_10А": "37",
    "Киев_ул_Ревуцкого_40_2": "130729",
    "Киев_ул_Срибнокильская_11": "139264",
    "Киев_ул_Харьковское_шоссе_160": "44",
    "Кривой_Рог_г_Кривой_Рог_ул_П_Дорошенко_15": "139226",
    "Кривой_Рог_мкр_н_Солнечный_41А": "61",
    "Кривой_Рог_пр_200_летия_Кривого_Рога_24": "130552",
    "Кривой_Рог_пр_Богдана_Хмельницького_118Д_ТЦ_Терра": "49",
    "Кривой_Рог_пр_Гагарина_54A": "130568",
    "Кривой_Рог_пр_Героев_подпольщиков_1А": "130526",
    "Кривой_Рог_пр_Металлургов_42А": "60",
    "Кривой_Рог_пр_Почтовый_25": "130711",
    "Кривой_Рог_пр_Южный_35": "62",
    "Кривой_Рог_ул_Владимира_Великого_36А": "130682",
    "Кривой_Рог_ул_Ивана_Авраменко_21В": "71",
    "Кривой_Рог_ул_Магистральная_23": "130524",
    "Кривой_Рог_ул_Мусоргского_17": "12",
    "Кривой_Рог_ул_Неделина_43": "130561",
    "Кривой_Рог_ул_Петра_Калнышевского_15А": "130715",
    "Кривой_Рог_ул_Свитальского_Николая_15": "130704",
    "Кривой_Рог_ул_Терещенко_1е": "130499",
    "Кривой_Рог_ул_Чаривна_1Б": "10",
    "Магдалиновка_ул_Центральная_56": "130505",
    "Марганец_ул_Лермонтова_10А": "139266",
    "Никополь_ул_Шевченка_223": "130492",
    "Новомосковск_ул_Сучкова_38": "130501",
    "Одесса_г_Одесса_Люстдорфская_дорога_114": "139251",
    "Одесса_г_Одесса_Радужный_массив_15_2": "139259",
    "Одесса_г_Одесса_пр_Добровольского_122_1": "130731",
    "Одесса_г_Одесса_ул_Василия_Спрейса_2": "130738",
    "Одесса_г_Одесса_ул_Дача_Ковалевского_91": "130748",
    "Одесса_г_Одесса_ул_Французский_бульвар_22": "139221",
    "Одесса_г_Одесса_ул_Ярослава_Баиса_9_А": "139263",
    "Одесса_пр_Гуляєва_полковника_ж_м_Дружний_буд_107_1": "139250",
    "Павлоград_ул_Днепровская_158а": "130726",
    "Павлоград_ул_Новая_2В": "56",
    "Павлоград_ул_Соборная_97_ТЦ_Куб": "79",
    "Павлоград_ул_Челюскинцев_14А": "130525",
    "Першотравенск_м_Шахтарське_вул_Шкільна_26А": "130502",
    "Петропавловка_ул_Соборная_10": "130506",
    "Покров_г_Покров_ул_Центральная_47а": "139254",
    "Соленое_ул_Гагарина_21": "130507",
    "Царичанка_ул_Первомайская_1": "139219",
    "с_Белогородка_с_Белогородка_ул_Саенко_Александра_11_1": "139218",
}